#### [`repos`] Terraform Plan 📖`success`



<details><summary>Show Plan</summary>

```tf
github_repository.cdktn-provider-cloudflare_repo_9C2FC896: Preparing import... [id=cdktn-provider-cloudflare]
github_repository.cdktn-provider-cloudflare-go_repo_67484681: Preparing import... [id=cdktn-provider-cloudflare-go]
data.github_team.cdktn-team-cdk-terrain: Reading...
data.github_team.cdktn-team-cdk-terrain: Read complete after 5s [id=15746607]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_actions_secret.cdktn-provider-cloudflare_repo_secret-alert-prs-slack-webhook-url_60417453 will be created
  + resource "github_actions_secret" "cdktn-provider-cloudflare_repo_secret-alert-prs-slack-webhook-url_60417453" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-cloudflare"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-cloudflare_repo_secret-gh-app-id-alias-PROJEN_APP_ID_81000AFB will be created
  + resource "github_actions_secret" "cdktn-provider-cloudflare_repo_secret-gh-app-id-alias-PROJEN_APP_ID_81000AFB" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-cloudflare"
      + secret_name     = "PROJEN_APP_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-cloudflare_repo_secret-gh-app-id_C2EE870D will be created
  + resource "github_actions_secret" "cdktn-provider-cloudflare_repo_secret-gh-app-id_C2EE870D" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-cloudflare"
      + secret_name     = "GH_APP_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-cloudflare_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_C1931664 will be created
  + resource "github_actions_secret" "cdktn-provider-cloudflare_repo_secret-gh-app-private-key-alias-PROJEN_APP_PRIVATE_KEY_C1931664" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-cloudflare"
      + secret_name     = "PROJEN_APP_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-cloudflare_repo_secret-gh-app-private-key_C155F96A will be created
  + resource "github_actions_secret" "cdktn-provider-cloudflare_repo_secret-gh-app-private-key_C155F96A" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-cloudflare"
      + secret_name     = "GH_APP_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-cloudflare_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_21A9DBA9 will be created
  + resource "github_actions_secret" "cdktn-provider-cloudflare_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_21A9DBA9" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-cloudflare"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-cloudflare_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_F7495BBA will be created
  + resource "github_actions_secret" "cdktn-provider-cloudflare_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_F7495BBA" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-cloudflare"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-cloudflare_repo_secret-gh-token_D9BA6B0C will be created
  + resource "github_actions_secret" "cdktn-provider-cloudflare_repo_secret-gh-token_D9BA6B0C" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-cloudflare"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-cloudflare_repo_secret-npm-token_6880ECE4 will be created
  + resource "github_actions_secret" "cdktn-provider-cloudflare_repo_secret-npm-token_6880ECE4" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-cloudflare"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-cloudflare_repo_secret-twine-password_39ABFA38 will be created
  + resource "github_actions_secret" "cdktn-provider-cloudflare_repo_secret-twine-password_39ABFA38" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-cloudflare"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktn-provider-cloudflare_repo_secret-twine-username_44DC4E94 will be created
  + resource "github_actions_secret" "cdktn-provider-cloudflare_repo_secret-twine-username_44DC4E94" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktn-provider-cloudflare"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_branch_protection.cdktn-provider-cloudflare_repository-setup_main-protection_341CF737 will be created
  + resource "github_branch_protection" "cdktn-provider-cloudflare_repository-setup_main-protection_341CF737" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "cdktn-provider-cloudflare"
      + require_conversation_resolution = true
      + require_signed_commits          = false
      + required_linear_history         = true

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
        }

      + required_status_checks {
          + contexts = [
              + "Validate PR title",
              + "build",
              + "package-go",
              + "package-js",
              + "package-python",
            ]
          + strict   = false
        }
    }

  # github_issue_label.cdktn-provider-cloudflare-go_repository-setup_auto-approve-label_9BE022FE will be created
  + resource "github_issue_label" "cdktn-provider-cloudflare-go_repository-setup_auto-approve-label_9BE022FE" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktn-provider-cloudflare-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-cloudflare-go_repository-setup_automerge-label_B622936D will be created
  + resource "github_issue_label" "cdktn-provider-cloudflare-go_repository-setup_automerge-label_B622936D" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktn-provider-cloudflare-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-cloudflare-go_repository-setup_no-auto-close-label_839A250D will be created
  + resource "github_issue_label" "cdktn-provider-cloudflare-go_repository-setup_no-auto-close-label_839A250D" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktn-provider-cloudflare-go"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-cloudflare_repository-setup_auto-approve-label_D7436DD4 will be created
  + resource "github_issue_label" "cdktn-provider-cloudflare_repository-setup_auto-approve-label_D7436DD4" {
      + color      = "8BF8BD"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "auto-approve"
      + repository = "cdktn-provider-cloudflare"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-cloudflare_repository-setup_automerge-label_C883477D will be created
  + resource "github_issue_label" "cdktn-provider-cloudflare_repository-setup_automerge-label_C883477D" {
      + color      = "5DC8DB"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "automerge"
      + repository = "cdktn-provider-cloudflare"
      + url        = (known after apply)
    }

  # github_issue_label.cdktn-provider-cloudflare_repository-setup_no-auto-close-label_E61B2802 will be created
  + resource "github_issue_label" "cdktn-provider-cloudflare_repository-setup_no-auto-close-label_E61B2802" {
      + color      = "EE2222"
      + etag       = (known after apply)
      + id         = (known after apply)
      + name       = "no-auto-close"
      + repository = "cdktn-provider-cloudflare"
      + url        = (known after apply)
    }

  # github_repository.cdktn-provider-cloudflare-go_repo_67484681 will be updated in-place
  # (imported from "cdktn-provider-cloudflare-go")
  ~ resource "github_repository" "cdktn-provider-cloudflare-go_repo_67484681" {
      ~ allow_auto_merge            = false -> true
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
      ~ allow_update_branch         = false -> true
      + archive_on_destroy          = true
        archived                    = false
      ~ auto_init                   = false -> true
        default_branch              = "main"
      ~ delete_branch_on_merge      = false -> true
      + description                 = "CDK Terrain Go provider bindings for cloudflare."
        etag                        = "W/\"1677ba5bc72ec4394545feaa64f8e4a8e561705a81972fbf2130713c859830d4\""
        full_name                   = "cdktn-io/cdktn-provider-cloudflare-go"
        git_clone_url               = "git://github.com/cdktn-io/cdktn-provider-cloudflare-go.git"
        has_discussions             = false
      - has_downloads               = true -> null
      ~ has_issues                  = true -> false
      ~ has_projects                = true -> false
      ~ has_wiki                    = true -> false
      + homepage_url                = "https://cdktn.io"
        html_url                    = "https://github.com/cdktn-io/cdktn-provider-cloudflare-go"
        http_clone_url              = "https://github.com/cdktn-io/cdktn-provider-cloudflare-go.git"
        id                          = "cdktn-provider-cloudflare-go"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "cdktn-provider-cloudflare-go"
        node_id                     = "R_kgDORTjcCA"
        primary_language            = "Go"
        private                     = false
        repo_id                     = 1161354248
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        ssh_clone_url               = "git@github.com:cdktn-io/cdktn-provider-cloudflare-go.git"
        svn_url                     = "https://github.com/cdktn-io/cdktn-provider-cloudflare-go"
      ~ topics                      = [
          + "cdk",
          + "cdk-terrain",
          + "cdktf",
          + "cdktn",
          + "cloudflare",
          + "opentofu",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
        ]
        visibility                  = "public"
      ~ vulnerability_alerts        = true -> false
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "disabled"
            }
            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # github_repository.cdktn-provider-cloudflare_repo_9C2FC896 will be updated in-place
  # (imported from "cdktn-provider-cloudflare")
  ~ resource "github_repository" "cdktn-provider-cloudflare_repo_9C2FC896" {
      ~ allow_auto_merge            = false -> true
        allow_merge_commit          = true
        allow_rebase_merge          = true
        allow_squash_merge          = true
      ~ allow_update_branch         = false -> true
      + archive_on_destroy          = true
        archived                    = false
      ~ auto_init                   = false -> true
        default_branch              = "main"
      ~ delete_branch_on_merge      = false -> true
      + description                 = "Prebuilt CDK Terrain (cdktn) provider for cloudflare."
        etag                        = "W/\"305d273fdbbe4a17bdb89f43fbdf546d7e93dd0b5733ae7d588b635ce6548c38\""
        full_name                   = "cdktn-io/cdktn-provider-cloudflare"
        git_clone_url               = "git://github.com/cdktn-io/cdktn-provider-cloudflare.git"
        has_discussions             = false
      - has_downloads               = true -> null
        has_issues                  = true
      ~ has_projects                = true -> false
      ~ has_wiki                    = true -> false
      + homepage_url                = "https://cdktn.io"
        html_url                    = "https://github.com/cdktn-io/cdktn-provider-cloudflare"
        http_clone_url              = "https://github.com/cdktn-io/cdktn-provider-cloudflare.git"
        id                          = "cdktn-provider-cloudflare"
        is_template                 = false
        merge_commit_message        = "PR_TITLE"
        merge_commit_title          = "MERGE_MESSAGE"
        name                        = "cdktn-provider-cloudflare"
        node_id                     = "R_kgDORTja_A"
        primary_language            = "TypeScript"
        private                     = false
        repo_id                     = 1161353980
      ~ squash_merge_commit_message = "COMMIT_MESSAGES" -> "PR_BODY"
      ~ squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> "PR_TITLE"
        ssh_clone_url               = "git@github.com:cdktn-io/cdktn-provider-cloudflare.git"
        svn_url                     = "https://github.com/cdktn-io/cdktn-provider-cloudflare"
      ~ topics                      = [
          + "cdk",
          + "cdk-terrain",
          + "cdktf",
          + "cdktn",
          + "cloudflare",
          + "opentofu",
          + "pre-built-provider",
          + "provider",
          + "terraform",
          + "terraform-cdk",
        ]
        visibility                  = "public"
        vulnerability_alerts        = true
        web_commit_signoff_required = false

        security_and_analysis {
            secret_scanning {
                status = "disabled"
            }
            secret_scanning_push_protection {
                status = "disabled"
            }
        }
    }

  # github_repository_dependabot_security_updates.cdktn-provider-cloudflare_dependabot-security_3FF89760 will be created
  + resource "github_repository_dependabot_security_updates" "cdktn-provider-cloudflare_dependabot-security_3FF89760" {
      + enabled    = true
      + id         = (known after apply)
      + repository = "cdktn-provider-cloudflare"
    }

  # github_repository_webhook.cdktn-provider-cloudflare-go_repository-setup_slack-webhook_3FDAC4E8 will be created
  + resource "github_repository_webhook" "cdktn-provider-cloudflare-go_repository-setup_slack-webhook_3FDAC4E8" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issues",
        ]
      + id         = (known after apply)
      + repository = "cdktn-provider-cloudflare-go"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + url          = (sensitive value)
        }
    }

  # github_repository_webhook.cdktn-provider-cloudflare_repository-setup_slack-webhook_0887DABE will be created
  + resource "github_repository_webhook" "cdktn-provider-cloudflare_repository-setup_slack-webhook_0887DABE" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "issues",
        ]
      + id         = (known after apply)
      + repository = "cdktn-provider-cloudflare"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + url          = (sensitive value)
        }
    }

  # github_team_repository.cdktn-provider-cloudflare-go_repository-setup_managing-team_B6CA9550 will be created
  + resource "github_team_repository" "cdktn-provider-cloudflare-go_repository-setup_managing-team_B6CA9550" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cdktn-provider-cloudflare-go"
      + team_id    = "15746607"
    }

  # github_team_repository.cdktn-provider-cloudflare_repository-setup_managing-team_9081B190 will be created
  + resource "github_team_repository" "cdktn-provider-cloudflare_repository-setup_managing-team_9081B190" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "admin"
      + repository = "cdktn-provider-cloudflare"
      + team_id    = "15746607"
    }

Plan: 2 to import, 23 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ providerRepos   = [
        # (3 unchanged elements hidden)
        "github_repository.cdktn-provider-azurerm_repo_25F8C0DE.ssh_clone_url",
      + "github_repository.cdktn-provider-cloudflare_repo_9C2FC896.ssh_clone_url",
        "github_repository.cdktn-provider-cloudinit_repo_8DDE9C9A.ssh_clone_url",
        # (12 unchanged elements hidden)
    ]

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @team-cdk-terrain[bot], Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*